Revit 2027 API
FlexDuct.IsHVACSystemTypeId Method
 Checks if given type is valid HVAC system type.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsHVACSystemTypeId(
	Document document,
	ElementId systemTypeId
)
Public Shared Function IsHVACSystemTypeId (
	document As Document,
	systemTypeId As ElementId
) As Boolean
public:
static bool IsHVACSystemTypeId(
	Document^ document,
	ElementId^ systemTypeId
)
static member IsHVACSystemTypeId :
        document : Document *
        systemTypeId : ElementId -> bool
Parameters
document Document
 The document.
systemTypeId ElementId
 ElementId of the HVAC system type to check.
Return Value
Boolean
 True if the given systemTypeId is the HVAC system type, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FlexDuct Class
Autodesk.Revit.DB.Mechanical Namespace